In [1]:
import pandas as pd

In [2]:
# use of pivot

In [26]:
x = pd.DataFrame ({"store":['a1','a2','a3','a2','a1','a3'],
                  'year':[2014,2015,2016,2017,2018,2019],
                  "total sales(rs)":[12000,13000,14000,15000,18000,19000],
                  "total profit":[2500,3500,4500,6000,8000,9000]})
print(x)

  store  year  total sales(rs)  total profit
0    a1  2014            12000          2500
1    a2  2015            13000          3500
2    a3  2016            14000          4500
3    a2  2017            15000          6000
4    a1  2018            18000          8000
5    a3  2019            19000          9000

In [9]:
y = x[x.store=="a1"]
print(y)
t = y['total sales(rs)'].sum()
print(t)

  store  year  total sales(rs)  total profit
0    a1  2014            12000          2500
4    a1  2018            18000          8000
30000

In [10]:
a =x.pivot(index ="store", columns ="year",values ="total sales(rs)")
print(a)

year      2014     2015     2016     2017     2018     2019
store
a1     12000.0      NaN      NaN      NaN  18000.0      NaN
a2         NaN  13000.0      NaN  15000.0      NaN      NaN
a3         NaN      NaN  14000.0      NaN      NaN  19000.0

In [14]:
b = a.loc['a1']
print(b)

year
2014    12000.0
2015        NaN
2016        NaN
2017        NaN
2018    18000.0
2019        NaN
Name: a1, dtype: float64

In [ ]:
b = a.loc['a3'].sum()
print(b)

In [13]:
b = a.loc['a3'].max()
print(b)

19000.0

In [21]:
m = a.loc["a3"].max()
n = a.loc["a2"].max()
o = a.loc["a1"].max()
print(max(m,n,o))

19000.0

In [24]:
if m>n and m>o:
    print("m is greater value :",m)
elif n>m and n>o:
    print("n isgreater value :",n)
else:
    print("o is greater value :",o)

m is greater value : 19000.0

In [27]:
b =x.pivot(index ="store", columns ="year",values ="total profit")
print(b)

year     2014    2015    2016    2017    2018    2019
store
a1     2500.0     NaN     NaN     NaN  8000.0     NaN
a2        NaN  3500.0     NaN  6000.0     NaN     NaN
a3        NaN     NaN  4500.0     NaN     NaN  9000.0

In [29]:
# drop duplicate

x = pd.DataFrame({"fruit":["apple","mango","banana","papaya","mango","apple"],"cost":[78,76,79,85,88,82]})
print(x)

    fruit  cost
0   apple    78
1   mango    76
2  banana    79
3  papaya    85
4   mango    88
5   apple    82

In [35]:
iris = pd.read_csv('C:/Users/acer/Downloads/archive/IRIS.csv')

print(iris)

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [36]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [37]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [38]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [40]:
iris.shape

(150, 5)

In [44]:
x =iris[['sepal_length','petal_length']]
print(x)

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [46]:
x.tail(10)

     sepal_length  petal_length
140           6.7           5.6
141           6.9           5.1
142           5.8           5.1
143           6.8           5.9
144           6.7           5.7
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1